# 3. «адание на закрепление знаний по модулю yaml. Ќаписать скрипт,
# автоматизирующий # сохранение данных в файле YAML-формата.
# ƒл€ этого:
# ѕодготовить данные дл€ записи в виде словар€, в котором первому
# ключу соответствует список, второму Ч целое число, третьему Ч
# вложенный словарь, где значение каждого ключа Ч это целое число
# с юникод-символом, отсутствующим в кодировке ASCII (например, И);
# –еализовать сохранение данных в файл формата YAML Ч например,
# в файл file.yaml. ѕри этом обеспечить стилизацию файла с помощью
# параметра default_flow_style, а также установить возможность
# работы с юникодом: allow_unicode = True;
# –еализовать считывание данных из созданного файла и проверить,
# совпадают ли они с исходными.
